#+TITLE: Emacs Configuration
#+STARTUP: content nohideblocks noalign
#+PROPERTY: header-args :comment yes

** More language modes
#+BEGIN_SRC emacs-lisp
  (use-package raku-mode :ensure t :defer t)
  (use-package fish-mode :ensure t :defer t)
  (use-package flycheck-haskell :ensure t :defer t
    :after haskell-mode
    :config
    (add-hook 'haskell-mode-hook #'flycheck-haskell-setup))
  (use-package rust-mode :ensure t)
  (use-package haskell-mode :ensure t)
  (use-package go-mode :ensure t)
  (use-package elm-mode :ensure t :defer t)
  ;;(use-package hamlet-mode :ensure t :defer t)
  (use-package shakespeare-mode
    :ensure t :defer t
    :config
    (add-hook 'shakespeare-mode-book 'rainbow-mode))

  ;; (use-package mmm-mode
  ;;   :config
  ;;   (progn
  ;;     (use-package hamlet-mode :ensure t)
  ;;     (setq mmm-global-mode t)
  ;;     (require 'mmm-auto)
  ;;     (mmm-add-classes
  ;;      '((hamlet-quasiquote
  ;;         :submode hamlet-mode
  ;;         :delimiter-mode nil
  ;;         :front "\\[.*hamlet|"
  ;;         :back "|\\]")))
  ;;     (mmm-add-mode-ext-class 'haskell-mode nil 'hamlet-quasiquote)))
  (use-package clojure-mode :ensure t)
  (use-package cider
    :ensure t
    :config
    ;; 23 JAN 2024
    ;; from https://www.youtube.com/watch?v=KMWLIgG986I
    (setq cider-repl-result-prefix ";; => "
          cider-eval-result-prefix ""
          ;;cider-connection-message-fn nil
          cider-repl-prompt-function #'myjin/cider-repl-prompt
          ;;cider-use-oeverlays nil ; echo area is fine
          cider-repl-display-help-banner nil
          ))
  (defun myjin/cider-repl-prompt (namespace)
    "Return a prompt string that mentions NAMESPACE."
    (format "%s🍀 " (cider-abbreviate-ns namespace)))
  ;; CSS 16 NOV 2025
  (use-package rainbow-mode
    :ensure t
    :hook ((css-mode . rainbow-mode)
           (scss-mode . rainbow-mode)
           (html-mode . rainbow-mode))
    :config
    (setq rainbow-x-colors nil))  ; X11 컬러 이름 비활성화 (선택사항)
#+END_SRC

#+RESULTS:
| rainbow-mode |

** DELEGATED GTD Method
CLOSED: [2024-01-29 Mon 18:23]
   :LOGBOOK:
   - CLOSING NOTE [2024-01-29 Mon 18:22] \\
     add more agenda files by using file-expand-wildcards
     https://emacs.stackexchange.com/questions/5560/wildcard-in-org-agenda-files
   CLOCK: [2020-05-27 Wed 00:40]--[2020-05-27 Wed 00:57] =>  0:17
   :END:
   - REF: https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-files-with-wildcards
        (list "~/git/study/org-agenda-*.org"
              "~/brainstorming/*.org"
              "~/brainstorming/org-roam/*.org"))

  (defun myjin/update-org-agenda-files-list ()
    "Reload agenda file: useful when writing any new org file after init"
    (setq org-agenda-files
          (apply #'append
                 (cons (list (myjin/expand-file-name "myoungjin-init.org" t)
                             "~/gtd/inbox.org"
                             "~/gtd/gtd.org"
                             "~/gtd/tickler.org")
                  ;; 29 Jan 2024
                  ;; Any org-mode file that begins with 'org-agenda-'
                  ;; in the study is recognized as an agenda file
                       (mapcar #'file-expand-wildcards org-agenda-files-with-wildcards)))))

  ;; for initializing
  (myjin/update-org-agenda-files-list)

  (setq org-capture-templates '(("t" "Todo [inbox]" entry
                                 (file+headline "~/gtd/inbox.org" "Tasks")
                                 "* TODO %i%?")
                                ("T" "Tickler" entry
                                 (file+headline "~/gtd/tickler.org" "Tickler")
                                 "* %i%? \n %U")))


  (setq org-refile-allow-creating-parent-nodes (quote confirm))
  (setq org-refile-use-outline-path (quote file))
  (setq org-refile-targets '(("~/gtd/gtd.org"      :maxlevel . 2)
                             ("~/gtd/someday.org"  :level    . 1)
                             ("~/gtd/tickler.org"  :maxlevel . 2)
                             ;; or simply same level
                             ;; (org-agenda-files  :level . 1 )
                             ;; nil for current file
                             ;; put line bellow at last so that it shows
                             ;; at the bottom when searching
                             (nil :maxlevel . 9)))

  ;; copied from https://www.reddit.com/r/emacs/comments/4366f9/how_do_orgrefiletargets_work/
  ;; I'm using ivy but still useful to search the tree to where I refile
  (setq org-outline-path-complete-in-steps nil) ; Refile in a single go
  (setq org-refile-use-outline-path t)    ; Show full paths for refiling

  (setq org-refile-allow-creating-parent-nodes 'confirm)

  (setq org-agenda-custom-commands
        '(("h" "at MJ home" tags-todo "@home"
          ;; ((org-agenda-overriding-header "home")))))
          ((org-agenda-overriding-header "home")
           (org-agenda-skip-function #'our/org-aenda-skip-all-siblings-but-first)))))

  ;; CREDIT: https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html
  (defun our/is-current-org-todo? ()
    (string= "TODO" (org-get-todo-state)))

  (defun our/org-aenda-skip-all-siblings-but-first ()
    "Skip all but the first undone entry"
    (let (skip-entry?)
      (unless (our/is-current-org-todo?)
        (setq skip-entry? t))

      (save-excursion
        (while (and (not skip-entry?) (org-goto-sibling t))
          (when (our/is-current-org-todo?)
            (setq skip-entry? t))))
      (when skip-entry?
        (or (outline-next-heading)
            (goto-char (point-max))))))

#+END_SRC

#+RESULTS:
: our/org-aenda-skip-all-siblings-but-first

